layer {
  name: "input_1"
  type: "Input"
  top: "input_1"
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 512
      dim: 688
    }
  }
}
layer {
  name: "conv2d_1"
  type: "Convolution"
  bottom: "input_1"
  top: "conv2d_1"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_1_activation"
  type: "ReLU"
  bottom: "conv2d_1"
  top: "conv2d_1"
}
layer {
  name: "max_pooling2d_1"
  type: "Pooling"
  bottom: "conv2d_1"
  top: "max_pooling2d_1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "conv2d_2"
  type: "Convolution"
  bottom: "max_pooling2d_1"
  top: "conv2d_2"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_10"
  type: "Convolution"
  bottom: "max_pooling2d_1"
  top: "conv2d_10"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_2_activation"
  type: "ReLU"
  bottom: "conv2d_2"
  top: "conv2d_2"
}
layer {
  name: "conv2d_10_activation"
  type: "ReLU"
  bottom: "conv2d_10"
  top: "conv2d_10"
}
layer {
  name: "max_pooling2d_2"
  type: "Pooling"
  bottom: "conv2d_2"
  top: "max_pooling2d_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "conv2d_3"
  type: "Convolution"
  bottom: "max_pooling2d_2"
  top: "conv2d_3"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_8"
  type: "Convolution"
  bottom: "max_pooling2d_2"
  top: "conv2d_8"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_3_activation"
  type: "ReLU"
  bottom: "conv2d_3"
  top: "conv2d_3"
}
layer {
  name: "conv2d_8_activation"
  type: "ReLU"
  bottom: "conv2d_8"
  top: "conv2d_8"
}
layer {
  name: "max_pooling2d_3"
  type: "Pooling"
  bottom: "conv2d_3"
  top: "max_pooling2d_3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "conv2d_4"
  type: "Convolution"
  bottom: "max_pooling2d_3"
  top: "conv2d_4"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_6"
  type: "Convolution"
  bottom: "max_pooling2d_3"
  top: "conv2d_6"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_4_activation"
  type: "ReLU"
  bottom: "conv2d_4"
  top: "conv2d_4"
}
layer {
  name: "conv2d_6_activation"
  type: "ReLU"
  bottom: "conv2d_6"
  top: "conv2d_6"
}
layer {
  name: "max_pooling2d_4"
  type: "Pooling"
  bottom: "conv2d_4"
  top: "max_pooling2d_4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad_h: 0
    pad_w: 0
  }
}
layer {
  name: "conv2d_5"
  type: "Convolution"
  bottom: "max_pooling2d_4"
  top: "conv2d_5"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_5_activation"
  type: "ReLU"
  bottom: "conv2d_5"
  top: "conv2d_5"
}
layer {
  name: "up_sampling2d_1"
  type: "Deconvolution"
  bottom: "conv2d_5"
  top: "up_sampling2d_1"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 128
    stride: 2
  }
}
layer {
  name: "concatenate_1"
  type: "Concat"
  bottom: "conv2d_6"
  bottom: "up_sampling2d_1"
  top: "concatenate_1"
  concat_param {
    axis: 1
  }
}
layer {
  name: "conv2d_7"
  type: "Convolution"
  bottom: "concatenate_1"
  top: "conv2d_7"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_7_activation"
  type: "ReLU"
  bottom: "conv2d_7"
  top: "conv2d_7"
}
layer {
  name: "up_sampling2d_2"
  type: "Deconvolution"
  bottom: "conv2d_7"
  top: "up_sampling2d_2"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 64
    stride: 2
  }
}
layer {
  name: "concatenate_2"
  type: "Concat"
  bottom: "conv2d_8"
  bottom: "up_sampling2d_2"
  top: "concatenate_2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "conv2d_9"
  type: "Convolution"
  bottom: "concatenate_2"
  top: "conv2d_9"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_9_activation"
  type: "ReLU"
  bottom: "conv2d_9"
  top: "conv2d_9"
}
layer {
  name: "up_sampling2d_3"
  type: "Deconvolution"
  bottom: "conv2d_9"
  top: "up_sampling2d_3"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 32
    stride: 2
  }
}
layer {
  name: "concatenate_3"
  type: "Concat"
  bottom: "conv2d_10"
  bottom: "up_sampling2d_3"
  top: "concatenate_3"
  concat_param {
    axis: 1
  }
}
layer {
  name: "conv2d_11"
  type: "Convolution"
  bottom: "concatenate_3"
  top: "conv2d_11"
  convolution_param {
    num_output: 16
    bias_term: true
    group: 1
    stride: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
  }
}
layer {
  name: "conv2d_11_activation"
  type: "ReLU"
  bottom: "conv2d_11"
  top: "conv2d_11"
}
layer {
  name: "up_sampling2d_4"
  type: "Deconvolution"
  bottom: "conv2d_11"
  top: "up_sampling2d_4"
  param {
    lr_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 4
    group: 16
    stride: 2
  }
}
layer {
  name: "conv2d_12"
  type: "Convolution"
  bottom: "up_sampling2d_4"
  top: "conv2d_12"
  convolution_param {
    num_output: 1
    bias_term: true
    group: 1
    stride: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
  }
}
layer {
  name: "conv2d_12_activation"
  type: "Sigmoid"
  bottom: "conv2d_12"
  top: "conv2d_12_activation"
}

